Infineon/AURIX_code_examples/code_examples/OneEye_DAS_QuickStart_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxPms_bf.h
/** \brief Length for Ifx_PMS_PMSIEN_Bits.WUTWKP */
#define IFX_PMS_PMSIEN_WUTWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.WUTWKP */
#define IFX_PMS_PMSIEN_WUTWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.WUTWKP */
#define IFX_PMS_PMSIEN_WUTWKP_OFF (21u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.ESR0WKP */
#define IFX_PMS_PMSIEN_ESR0WKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.ESR0WKP */
#define IFX_PMS_PMSIEN_ESR0WKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.ESR0WKP */
#define IFX_PMS_PMSIEN_ESR0WKP_OFF (22u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.ESR1WKP */
#define IFX_PMS_PMSIEN_ESR1WKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.ESR1WKP */
#define IFX_PMS_PMSIEN_ESR1WKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.ESR1WKP */
#define IFX_PMS_PMSIEN_ESR1WKP_OFF (23u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.PINAWKP */
#define IFX_PMS_PMSIEN_PINAWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.PINAWKP */
#define IFX_PMS_PMSIEN_PINAWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.PINAWKP */
#define IFX_PMS_PMSIEN_PINAWKP_OFF (24u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.PINBWKP */
#define IFX_PMS_PMSIEN_PINBWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.PINBWKP */
#define IFX_PMS_PMSIEN_PINBWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.PINBWKP */
#define IFX_PMS_PMSIEN_PINBWKP_OFF (25u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.SCRINT */
#define IFX_PMS_PMSIEN_SCRINT_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.SCRINT */
#define IFX_PMS_PMSIEN_SCRINT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.SCRINT */
#define IFX_PMS_PMSIEN_SCRINT_OFF (26u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.SCRRST */
#define IFX_PMS_PMSIEN_SCRRST_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.SCRRST */
#define IFX_PMS_PMSIEN_SCRRST_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.SCRRST */
#define IFX_PMS_PMSIEN_SCRRST_OFF (27u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.SCRECC */
#define IFX_PMS_PMSIEN_SCRECC_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.SCRECC */
#define IFX_PMS_PMSIEN_SCRECC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.SCRECC */
#define IFX_PMS_PMSIEN_SCRECC_OFF (28u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.SCRWDT */
#define IFX_PMS_PMSIEN_SCRWDT_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.SCRWDT */
#define IFX_PMS_PMSIEN_SCRWDT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.SCRWDT */
#define IFX_PMS_PMSIEN_SCRWDT_OFF (29u)

/** \brief Length for Ifx_PMS_UVMON_Bits.EVRCUVVAL */
#define IFX_PMS_UVMON_EVRCUVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_UVMON_Bits.EVRCUVVAL */
#define IFX_PMS_UVMON_EVRCUVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_UVMON_Bits.EVRCUVVAL */
#define IFX_PMS_UVMON_EVRCUVVAL_OFF (0u)

/** \brief Length for Ifx_PMS_UVMON_Bits.EVR33UVVAL */
#define IFX_PMS_UVMON_EVR33UVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_UVMON_Bits.EVR33UVVAL */
#define IFX_PMS_UVMON_EVR33UVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_UVMON_Bits.EVR33UVVAL */
#define IFX_PMS_UVMON_EVR33UVVAL_OFF (8u)

/** \brief Length for Ifx_PMS_UVMON_Bits.SWDUVVAL */
#define IFX_PMS_UVMON_SWDUVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_UVMON_Bits.SWDUVVAL */
#define IFX_PMS_UVMON_SWDUVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_UVMON_Bits.SWDUVVAL */
#define IFX_PMS_UVMON_SWDUVVAL_OFF (16u)

/** \brief Length for Ifx_PMS_UVMON_Bits.SLCK */
#define IFX_PMS_UVMON_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_UVMON_Bits.SLCK */
#define IFX_PMS_UVMON_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_UVMON_Bits.SLCK */
#define IFX_PMS_UVMON_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_OVMON_Bits.EVRCOVVAL */
#define IFX_PMS_OVMON_EVRCOVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_OVMON_Bits.EVRCOVVAL */
#define IFX_PMS_OVMON_EVRCOVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_OVMON_Bits.EVRCOVVAL */
#define IFX_PMS_OVMON_EVRCOVVAL_OFF (0u)

/** \brief Length for Ifx_PMS_OVMON_Bits.EVR33OVVAL */
#define IFX_PMS_OVMON_EVR33OVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_OVMON_Bits.EVR33OVVAL */
#define IFX_PMS_OVMON_EVR33OVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_OVMON_Bits.EVR33OVVAL */
#define IFX_PMS_OVMON_EVR33OVVAL_OFF (8u)

/** \brief Length for Ifx_PMS_OVMON_Bits.SWDOVVAL */
#define IFX_PMS_OVMON_SWDOVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_OVMON_Bits.SWDOVVAL */
#define IFX_PMS_OVMON_SWDOVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_OVMON_Bits.SWDOVVAL */
#define IFX_PMS_OVMON_SWDOVVAL_OFF (16u)

/** \brief Length for Ifx_PMS_OVMON_Bits.SLCK */
#define IFX_PMS_OVMON_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_OVMON_Bits.SLCK */
#define IFX_PMS_OVMON_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_OVMON_Bits.SLCK */
#define IFX_PMS_OVMON_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_UVMON2_Bits.PREUVVAL */
#define IFX_PMS_UVMON2_PREUVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_UVMON2_Bits.PREUVVAL */
#define IFX_PMS_UVMON2_PREUVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_UVMON2_Bits.PREUVVAL */
#define IFX_PMS_UVMON2_PREUVVAL_OFF (0u)

/** \brief Length for Ifx_PMS_UVMON2_Bits.VDDMUVVAL */
#define IFX_PMS_UVMON2_VDDMUVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_UVMON2_Bits.VDDMUVVAL */
#define IFX_PMS_UVMON2_VDDMUVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_UVMON2_Bits.VDDMUVVAL */
#define IFX_PMS_UVMON2_VDDMUVVAL_OFF (8u)

/** \brief Length for Ifx_PMS_UVMON2_Bits.SBUVVAL */
#define IFX_PMS_UVMON2_SBUVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_UVMON2_Bits.SBUVVAL */
#define IFX_PMS_UVMON2_SBUVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_UVMON2_Bits.SBUVVAL */
#define IFX_PMS_UVMON2_SBUVVAL_OFF (16u)

/** \brief Length for Ifx_PMS_UVMON2_Bits.VDDMLVLSEL */
#define IFX_PMS_UVMON2_VDDMLVLSEL_LEN (6u)

/** \brief Mask for Ifx_PMS_UVMON2_Bits.VDDMLVLSEL */
#define IFX_PMS_UVMON2_VDDMLVLSEL_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_UVMON2_Bits.VDDMLVLSEL */
#define IFX_PMS_UVMON2_VDDMLVLSEL_OFF (24u)

/** \brief Length for Ifx_PMS_UVMON2_Bits.SLCK */
#define IFX_PMS_UVMON2_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_UVMON2_Bits.SLCK */
#define IFX_PMS_UVMON2_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_UVMON2_Bits.SLCK */
#define IFX_PMS_UVMON2_SLCK_OFF (30u)

