Infineon/AURIX_code_examples/code_examples/OneEye_DAS_QuickStart_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxPms_bf.h
/** \brief Length for Ifx_PMS_PMSWCR4_Bits.PORSTREQ */
#define IFX_PMS_PMSWCR4_PORSTREQ_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR4_Bits.PORSTREQ */
#define IFX_PMS_PMSWCR4_PORSTREQ_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR4_Bits.PORSTREQ */
#define IFX_PMS_PMSWCR4_PORSTREQ_OFF (5u)

/** \brief Length for Ifx_PMS_PMSWCR4_Bits.SCRCLKSEL */
#define IFX_PMS_PMSWCR4_SCRCLKSEL_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR4_Bits.SCRCLKSEL */
#define IFX_PMS_PMSWCR4_SCRCLKSEL_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR4_Bits.SCRCLKSEL */
#define IFX_PMS_PMSWCR4_SCRCLKSEL_OFF (6u)

/** \brief Length for Ifx_PMS_PMSWCR4_Bits.SCRCFG */
#define IFX_PMS_PMSWCR4_SCRCFG_LEN (8u)

/** \brief Mask for Ifx_PMS_PMSWCR4_Bits.SCRCFG */
#define IFX_PMS_PMSWCR4_SCRCFG_MSK (0xffu)

/** \brief Offset for Ifx_PMS_PMSWCR4_Bits.SCRCFG */
#define IFX_PMS_PMSWCR4_SCRCFG_OFF (16u)

/** \brief Length for Ifx_PMS_PMSWCR4_Bits.BPSCREN */
#define IFX_PMS_PMSWCR4_BPSCREN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR4_Bits.BPSCREN */
#define IFX_PMS_PMSWCR4_BPSCREN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR4_Bits.BPSCREN */
#define IFX_PMS_PMSWCR4_BPSCREN_OFF (24u)

/** \brief Length for Ifx_PMS_PMSWCR4_Bits.SCREN */
#define IFX_PMS_PMSWCR4_SCREN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR4_Bits.SCREN */
#define IFX_PMS_PMSWCR4_SCREN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR4_Bits.SCREN */
#define IFX_PMS_PMSWCR4_SCREN_OFF (25u)

/** \brief Length for Ifx_PMS_PMSWCR5_Bits.BPTRISTREQ */
#define IFX_PMS_PMSWCR5_BPTRISTREQ_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR5_Bits.BPTRISTREQ */
#define IFX_PMS_PMSWCR5_BPTRISTREQ_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR5_Bits.BPTRISTREQ */
#define IFX_PMS_PMSWCR5_BPTRISTREQ_OFF (0u)

/** \brief Length for Ifx_PMS_PMSWCR5_Bits.TRISTREQ */
#define IFX_PMS_PMSWCR5_TRISTREQ_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR5_Bits.TRISTREQ */
#define IFX_PMS_PMSWCR5_TRISTREQ_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR5_Bits.TRISTREQ */
#define IFX_PMS_PMSWCR5_TRISTREQ_OFF (1u)

/** \brief Length for Ifx_PMS_PMSWCR5_Bits.ESR0TRIST */
#define IFX_PMS_PMSWCR5_ESR0TRIST_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR5_Bits.ESR0TRIST */
#define IFX_PMS_PMSWCR5_ESR0TRIST_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR5_Bits.ESR0TRIST */
#define IFX_PMS_PMSWCR5_ESR0TRIST_OFF (2u)

/** \brief Length for Ifx_PMS_PMSWCR5_Bits.PORSTDF */
#define IFX_PMS_PMSWCR5_PORSTDF_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR5_Bits.PORSTDF */
#define IFX_PMS_PMSWCR5_PORSTDF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR5_Bits.PORSTDF */
#define IFX_PMS_PMSWCR5_PORSTDF_OFF (4u)

/** \brief Length for Ifx_PMS_PMSWCR5_Bits.DCDCSYNCO */
#define IFX_PMS_PMSWCR5_DCDCSYNCO_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR5_Bits.DCDCSYNCO */
#define IFX_PMS_PMSWCR5_DCDCSYNCO_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR5_Bits.DCDCSYNCO */
#define IFX_PMS_PMSWCR5_DCDCSYNCO_OFF (6u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.HWCFGEVR */
#define IFX_PMS_PMSWSTAT_HWCFGEVR_LEN (2u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.HWCFGEVR */
#define IFX_PMS_PMSWSTAT_HWCFGEVR_MSK (0x3u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.HWCFGEVR */
#define IFX_PMS_PMSWSTAT_HWCFGEVR_OFF (1u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.HWCFG4 */
#define IFX_PMS_PMSWSTAT_HWCFG4_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.HWCFG4 */
#define IFX_PMS_PMSWSTAT_HWCFG4_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.HWCFG4 */
#define IFX_PMS_PMSWSTAT_HWCFG4_OFF (4u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.HWCFG5 */
#define IFX_PMS_PMSWSTAT_HWCFG5_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.HWCFG5 */
#define IFX_PMS_PMSWSTAT_HWCFG5_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.HWCFG5 */
#define IFX_PMS_PMSWSTAT_HWCFG5_OFF (5u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.TRIST */
#define IFX_PMS_PMSWSTAT_TRIST_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.TRIST */
#define IFX_PMS_PMSWSTAT_TRIST_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.TRIST */
#define IFX_PMS_PMSWSTAT_TRIST_OFF (6u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.TESTMODE */
#define IFX_PMS_PMSWSTAT_TESTMODE_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.TESTMODE */
#define IFX_PMS_PMSWSTAT_TESTMODE_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.TESTMODE */
#define IFX_PMS_PMSWSTAT_TESTMODE_OFF (7u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.ESR0TRIST */
#define IFX_PMS_PMSWSTAT_ESR0TRIST_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.ESR0TRIST */
#define IFX_PMS_PMSWSTAT_ESR0TRIST_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.ESR0TRIST */
#define IFX_PMS_PMSWSTAT_ESR0TRIST_OFF (8u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.PORSTDF */
#define IFX_PMS_PMSWSTAT_PORSTDF_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.PORSTDF */
#define IFX_PMS_PMSWSTAT_PORSTDF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.PORSTDF */
#define IFX_PMS_PMSWSTAT_PORSTDF_OFF (11u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.SCR */
#define IFX_PMS_PMSWSTAT_SCR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.SCR */
#define IFX_PMS_PMSWSTAT_SCR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.SCR */
#define IFX_PMS_PMSWSTAT_SCR_OFF (16u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.SCRST */
#define IFX_PMS_PMSWSTAT_SCRST_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.SCRST */
#define IFX_PMS_PMSWSTAT_SCRST_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.SCRST */
#define IFX_PMS_PMSWSTAT_SCRST_OFF (17u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.SCRCLK */
#define IFX_PMS_PMSWSTAT_SCRCLK_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.SCRCLK */
#define IFX_PMS_PMSWSTAT_SCRCLK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.SCRCLK */
#define IFX_PMS_PMSWSTAT_SCRCLK_OFF (18u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.PORSTREQ */
#define IFX_PMS_PMSWSTAT_PORSTREQ_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.PORSTREQ */
#define IFX_PMS_PMSWSTAT_PORSTREQ_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.PORSTREQ */
#define IFX_PMS_PMSWSTAT_PORSTREQ_OFF (19u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.WUTEN */
#define IFX_PMS_PMSWSTAT_WUTEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.WUTEN */
#define IFX_PMS_PMSWSTAT_WUTEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.WUTEN */
#define IFX_PMS_PMSWSTAT_WUTEN_OFF (24u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.WUTRUN */
#define IFX_PMS_PMSWSTAT_WUTRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.WUTRUN */
#define IFX_PMS_PMSWSTAT_WUTRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.WUTRUN */
#define IFX_PMS_PMSWSTAT_WUTRUN_OFF (25u)

