Infineon/AURIX_code_examples/code_examples/OneEye_DAS_QuickStart_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.ESR1OVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_ESR1OVRUNCLR_OFF (9u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.PINAOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_PINAOVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.PINAOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_PINAOVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.PINAOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_PINAOVRUNCLR_OFF (10u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.PINBOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_PINBOVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.PINBOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_PINBOVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.PINBOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_PINBOVRUNCLR_OFF (11u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.SCROVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_SCROVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.SCROVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_SCROVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.SCROVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_SCROVRUNCLR_OFF (13u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.PORSTOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_PORSTOVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.PORSTOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_PORSTOVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.PORSTOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_PORSTOVRUNCLR_OFF (14u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.WUTOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_WUTOVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.WUTOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_WUTOVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.WUTOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_WUTOVRUNCLR_OFF (15u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.SCRSTCLR */
#define IFX_PMS_PMSWSTATCLR_SCRSTCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.SCRSTCLR */
#define IFX_PMS_PMSWSTATCLR_SCRSTCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.SCRSTCLR */
#define IFX_PMS_PMSWSTATCLR_SCRSTCLR_OFF (16u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.ESR0INTCLR */
#define IFX_PMS_PMSWSTATCLR_ESR0INTCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.ESR0INTCLR */
#define IFX_PMS_PMSWSTATCLR_ESR0INTCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.ESR0INTCLR */
#define IFX_PMS_PMSWSTATCLR_ESR0INTCLR_OFF (28u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.ESR1INTCLR */
#define IFX_PMS_PMSWSTATCLR_ESR1INTCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.ESR1INTCLR */
#define IFX_PMS_PMSWSTATCLR_ESR1INTCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.ESR1INTCLR */
#define IFX_PMS_PMSWSTATCLR_ESR1INTCLR_OFF (29u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.PINAINTCLR */
#define IFX_PMS_PMSWSTATCLR_PINAINTCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.PINAINTCLR */
#define IFX_PMS_PMSWSTATCLR_PINAINTCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.PINAINTCLR */
#define IFX_PMS_PMSWSTATCLR_PINAINTCLR_OFF (30u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.PINBINTCLR */
#define IFX_PMS_PMSWSTATCLR_PINBINTCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.PINBINTCLR */
#define IFX_PMS_PMSWSTATCLR_PINBINTCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.PINBINTCLR */
#define IFX_PMS_PMSWSTATCLR_PINBINTCLR_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDSTAT0_Bits.ADCFBCV */
#define IFX_PMS_EVRSDSTAT0_ADCFBCV_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDSTAT0_Bits.ADCFBCV */
#define IFX_PMS_EVRSDSTAT0_ADCFBCV_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDSTAT0_Bits.ADCFBCV */
#define IFX_PMS_EVRSDSTAT0_ADCFBCV_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDSTAT0_Bits.DPWMOUT */
#define IFX_PMS_EVRSDSTAT0_DPWMOUT_LEN (12u)

/** \brief Mask for Ifx_PMS_EVRSDSTAT0_Bits.DPWMOUT */
#define IFX_PMS_EVRSDSTAT0_DPWMOUT_MSK (0xfffu)

/** \brief Offset for Ifx_PMS_EVRSDSTAT0_Bits.DPWMOUT */
#define IFX_PMS_EVRSDSTAT0_DPWMOUT_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL0_Bits.SDFREQSPRD */
#define IFX_PMS_EVRSDCTRL0_SDFREQSPRD_LEN (16u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL0_Bits.SDFREQSPRD */
#define IFX_PMS_EVRSDCTRL0_SDFREQSPRD_MSK (0xffffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL0_Bits.SDFREQSPRD */
#define IFX_PMS_EVRSDCTRL0_SDFREQSPRD_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL0_Bits.SDFREQ */
#define IFX_PMS_EVRSDCTRL0_SDFREQ_LEN (12u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL0_Bits.SDFREQ */
#define IFX_PMS_EVRSDCTRL0_SDFREQ_MSK (0xfffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL0_Bits.SDFREQ */
#define IFX_PMS_EVRSDCTRL0_SDFREQ_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL0_Bits.NGOFF */
#define IFX_PMS_EVRSDCTRL0_NGOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL0_Bits.NGOFF */
#define IFX_PMS_EVRSDCTRL0_NGOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL0_Bits.NGOFF */
#define IFX_PMS_EVRSDCTRL0_NGOFF_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCTRL0_Bits.PGOFF */
#define IFX_PMS_EVRSDCTRL0_PGOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL0_Bits.PGOFF */
#define IFX_PMS_EVRSDCTRL0_PGOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL0_Bits.PGOFF */
#define IFX_PMS_EVRSDCTRL0_PGOFF_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCTRL0_Bits.UP */
#define IFX_PMS_EVRSDCTRL0_UP_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL0_Bits.UP */
#define IFX_PMS_EVRSDCTRL0_UP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL0_Bits.UP */
#define IFX_PMS_EVRSDCTRL0_UP_OFF (30u)

/** \brief Length for Ifx_PMS_EVRSDCTRL0_Bits.LCK */
#define IFX_PMS_EVRSDCTRL0_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL0_Bits.LCK */
#define IFX_PMS_EVRSDCTRL0_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL0_Bits.LCK */
#define IFX_PMS_EVRSDCTRL0_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL1_Bits.M0TOFF */
#define IFX_PMS_EVRSDCTRL1_M0TOFF_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL1_Bits.M0TOFF */
#define IFX_PMS_EVRSDCTRL1_M0TOFF_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL1_Bits.M0TOFF */
#define IFX_PMS_EVRSDCTRL1_M0TOFF_OFF (0u)

